{
  "baseline value": "The average fetal heart rate measured over a period, usually between 110–160 bpm.",
  "accelerations": "Brief increases in fetal heart rate, a reassuring sign of oxygen and health.",
  "fetal_movement": "Recorded movements of the fetus, indicating activity and wellbeing.",
  "uterine_contractions": "Frequency and strength of maternal contractions affecting oxygen delivery.",
  "light_decelerations": "Mild drops in fetal heart rate, often benign if infrequent.",
  "severe_decelerations": "Strong and prolonged drops in heart rate, suggesting possible fetal distress.",
  "prolongued_decelerations": "Heart rate decreases lasting more than 2 minutes, potentially serious.",
  "abnormal_short_term_variability": "Low beat-to-beat variation in heart rate, a possible warning sign.",
  "mean_value_of_short_term_variability": "The average variation in heart rate between consecutive beats.",
  "percentage_of_time_with_abnormal_long_term_variability": "Proportion of time with reduced long-term heart rate variability.",
  "mean_value_of_long_term_variability": "Average fluctuation in fetal heart rate over longer intervals.",
  "histogram_width": "Range of heart rate values observed in the recording.",
  "histogram_min": "The lowest fetal heart rate value measured.",
  "histogram_max": "The highest fetal heart rate value measured.",
  "histogram_number_of_peaks": "Number of distinct high-frequency peaks in the heart rate distribution.",
  "histogram_number_of_zeroes": "Count of intervals with zero frequency in the heart rate histogram.",
  "histogram_mode": "Most frequently occurring fetal heart rate value.",
  "histogram_mean": "Average fetal heart rate derived from the histogram.",
  "histogram_median": "Middle value of fetal heart rate distribution.",
  "histogram_variance": "Spread of heart rate values, reflecting variability.",
  "histogram_tendency": "Overall trend or skewness in the fetal heart rate distribution.",
  "fetal_health": "Predicted outcome of fetal condition: healthy, suspect, or pathological."
}
